app/controllers/admin/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("password_hash", "created_at", "name", "email", "updated_at", "password_salt") VALUES('$2a$10$DJ.So3FOjO6Nn5Hb7OJ/H.Us.m.RXJviMv97vodWqZ8v9F0NPJDj.', '2013-02-16 08:06:46', 'JamesD', 'james@deuchar.com', '2013-02-16 08:06:46', '$2a$10$DJ.So3FOjO6Nn5Hb7OJ/H.')