app/controllers/event_series_controller.rb

SELECT * FROM "event_series"
---
  def index
    @event_series = EventSeries.all