app/controllers/exhibitors_controller.rb

  def index
    @exhibitors = Exhibitor.all(:order => sort_column + " " + sort_direction)
---
SELECT * FROM "exhibitors" ORDER BY contact_last_name desc

  def create
    @exhibitor = Exhibitor.new(params[:exhibitor])

    respond_to do |format|
      if @exhibitor.save
---
INSERT INTO "exhibitors" ("contact_email", "created_at", "contact_phone_2_type", "company_name", "contact_phone_1", "contact_phone_2", "rating", "address_1", "address_2", "address_3", "source", "updated_by", "town", "category", "contact_last_name", "post_code", "created_by", "contact_first_name", "company_website", "updated_at", "contact_phone_1_type", "county") VALUES('james@tester.com', '2013-02-15 17:08:56', '1', 'Test', '012345678', '07777777', '4', '', '', '', 'Source', NULL, '', '1', 'DEuchar', '', NULL, 'James', 'here', '2013-02-15 17:08:56', '2', '')

  def update

    respond_to do |format|
      if @exhibitor.update_attributes(params[:exhibitor])
---
UPDATE "exhibitors" SET "address_3" = 'Everywhere', "town" = 'Somewhere', "contact_phone_2" = '1234567789', "address_2" = 'There', "updated_at" = '2013-02-10 20:10:32', "contact_phone_1" = '01234567889', "address_1" = 'HEre', "contact_first_name" = 'James', "post_code" = 'GU7 2AS', "county" = 'Over there', "contact_last_name" = 'Deuchar' WHERE "id" = 1

  def destroy
    @exhibitor.destroy
---
DELETE FROM "exhibitors" WHERE "id" = 1

    def find_exhibitor
      @exhibitor = Exhibitor.find(params[:id])
---
SELECT * FROM "exhibitors" WHERE ("exhibitors"."id" = 2)