app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("updated_at", "created_at", "password_salt", "password_hash", "email") VALUES('2013-02-09 20:30:19', '2013-02-09 20:30:19', '$2a$10$HMZf9LKd6KH/Y0gYS4GWC.', '$2a$10$HMZf9LKd6KH/Y0gYS4GWC.EMfs0IezQ9RUj62PdJkYsAcJW/cT6DW', 'jamesdeuchar@gmail.com')